In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split 
from sklearn.preprocessing import StandardScaler , MinMaxScaler
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score , mean_squared_error
from sklearn import linear_model
from sklearn.impute import SimpleImputer

In [2]:
df = pd.read_csv("Cleaned_Official_Data.csv")
df

,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Education_Level,Race
0,GE Digital,Software Engineer,140000,"San Ramon, CA",4.0,4.0,130000,0.0,10000.0,Male,No Education,NaN
1,Amazon,Software Engineer,172000,"Seattle, WA",12.0,2.0,142000,30000.0,0.0,Male,No Education,NaN
2,Uber,Software Engineer,325000,"San Francisco, CA",7.0,2.0,161000,140000.0,25000.0,Male,No Education,NaN
3,Microsoft,Software Engineer,150000,"Seattle, WA",4.0,0.0,118000,5000.0,12000.0,Male,No Education,NaN
4,Google,Software Engineer,640000,"Mountain View, CA",11.0,4.0,210000,380000.0,50000.0,Male,No Education,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
41499,Amazon,Software Engineer,135000,"Seattle, WA",1.0,0.0,104000,3000.0,18500.0,Male,No Education,NaN
41500,Amazon,Software Engineer,350000,"Austin, TX",14.0,1.0,160000,175000.0,56250.0,Male,No Education,NaN
41501,Microsoft,Product Manager,305000,"Seattle, WA",20.0,2.0,200000,75000.0,30000.0,Female,No Education,NaN
41502,Amazon,Software Engineer,152000,"Seattle, WA",3.0,0.0,106000,26000.0,20000.0,Male,No Education,NaN
41503,apple,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,155000,27000.0,19000.0,Male,No Education,NaN

In [59]:
df['company'].value_counts()[:50]

Amazon               5346
Microsoft            3544
Google               2838
Facebook             2014
Apple                1346
Oracle                775
Intel                 667
Salesforce            642
IBM                   630
Cisco                 628
Uber                  569
Capital One           542
VMware                430
LinkedIn              427
JPMorgan Chase        390
Bloomberg             358
Qualcomm              354
Goldman Sachs         328
Intuit                314
PayPal                296
Deloitte              275
Adobe                 261
SAP                   259
Wayfair               254
Twitter               251
Walmart Labs          249
Expedia               244
Accenture             244
Nvidia                237
eBay                  216
Lyft                  212
Shopify               172
Dropbox               163
Workday               161
Airbnb                154
Atlassian             154
Yelp                  148
Visa                  147
Dell Technologies     142
Yandex                131
ServiceNow            128
Snap                  126
Square                122
Stripe                121
Tesla                 120
Yahoo                 115
Zillow                115
Comcast               114
Spotify               103
EPAM Systems          101
Name: company, dtype: int64

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [67]:
df['company'] = le.fit_transform(salary_data['company'])

In [70]:
df['company'].value_counts()[:50]

61      5346
762     3544
517     2838
428     2014
90      1346
858      775
604      667
996      642
572      630
258      628
1183     569
221      542
1202     430
678      427
625      390
164      358
924      354
515      328
612      314
879      296
345      275
31       261
982      259
1235     254
1174     251
1229     249
419      244
21       244
832      237
1339     216
697      212
1019     172
382      163
1256     161
37       154
111      154
1271     148
1216     147
344      142
1270     131
1012     128
1035     126
1058     122
1074     121
1120     120
1269     115
1282     115
285      114
1055     103
389      101
Name: company, dtype: int64

In [72]:
df

,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Education_Level,Race
0,472,Software Engineer,140000,"San Ramon, CA",4.0,4.0,130000,0.0,10000.0,Male,No Education,NaN
1,61,Software Engineer,172000,"Seattle, WA",12.0,2.0,142000,30000.0,0.0,Male,No Education,NaN
2,1183,Software Engineer,325000,"San Francisco, CA",7.0,2.0,161000,140000.0,25000.0,Male,No Education,NaN
3,762,Software Engineer,150000,"Seattle, WA",4.0,0.0,118000,5000.0,12000.0,Male,No Education,NaN
4,517,Software Engineer,640000,"Mountain View, CA",11.0,4.0,210000,380000.0,50000.0,Male,No Education,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
41499,61,Software Engineer,135000,"Seattle, WA",1.0,0.0,104000,3000.0,18500.0,Male,No Education,NaN
41500,61,Software Engineer,350000,"Austin, TX",14.0,1.0,160000,175000.0,56250.0,Male,No Education,NaN
41501,762,Product Manager,305000,"Seattle, WA",20.0,2.0,200000,75000.0,30000.0,Female,No Education,NaN
41502,61,Software Engineer,152000,"Seattle, WA",3.0,0.0,106000,26000.0,20000.0,Male,No Education,NaN
41503,1304,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,155000,27000.0,19000.0,Male,No Education,NaN

In [75]:
df['gender'] = le.fit_transform(df['gender'])

In [76]:
df['location'] = le.fit_transform(df['location'])

In [78]:
df['Education_Level'] = le.fit_transform(df['Education_Level'])

In [79]:
df['Race'] = le.fit_transform(df['Race'])

In [84]:
df['title'] = le.fit_transform(df['title'])

In [101]:
new_df = df
new_df.to_csv('Cleaned_Official_Data_New.csv', index= False)

In [88]:
new_df

,company,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,basesalary,stockgrantvalue,bonus,gender,Education_Level,Race
0,472,11,140000,729,4.0,4.0,130000,0.0,10000.0,1,4,5
1,61,11,172000,748,12.0,2.0,142000,30000.0,0.0,1,4,5
2,1183,11,325000,718,7.0,2.0,161000,140000.0,25000.0,1,4,5
3,762,11,150000,748,4.0,0.0,118000,5000.0,12000.0,1,4,5
4,517,11,640000,537,11.0,4.0,210000,380000.0,50000.0,1,4,5
...,...,...,...,...,...,...,...,...,...,...,...,...
41499,61,11,135000,748,1.0,0.0,104000,3000.0,18500.0,1,4,5
41500,61,11,350000,47,14.0,1.0,160000,175000.0,56250.0,1,4,5
41501,762,8,305000,748,20.0,2.0,200000,75000.0,30000.0,0,4,5
41502,61,11,152000,748,3.0,0.0,106000,26000.0,20000.0,1,4,5
41503,1304,11,200000,797,0.0,0.0,155000,27000.0,19000.0,1,4,5

# Linear Regression Model

An attempt at a linear regression model for predicting salary based on company, total yearly compensation, years of experience, and gender.

In [91]:
salary_data = new_df[['company', 'totalyearlycompensation', 'yearsofexperience', 'yearsatcompany', 'gender']]

In [93]:
salary_data

,company,totalyearlycompensation,yearsofexperience,yearsatcompany,gender
0,472,140000,4.0,4.0,1
1,61,172000,12.0,2.0,1
2,1183,325000,7.0,2.0,1
3,762,150000,4.0,0.0,1
4,517,640000,11.0,4.0,1
...,...,...,...,...,...
41499,61,135000,1.0,0.0,1
41500,61,350000,14.0,1.0,1
41501,762,305000,20.0,2.0,0
41502,61,152000,3.0,0.0,1
41503,1304,200000,0.0,0.0,1

In [94]:
from sklearn.model_selection import train_test_split

# Split the data into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(salary_data[['company', 'yearsofexperience', 'yearsatcompany','gender']], salary_data['totalyearlycompensation'], test_size=0.2, random_state=42)

# Print the shape of the training and testing sets
print("Training set shape:", X_train.shape)
print("Testing set shape:", X_test.shape)

Training set shape: (33203, 4)
Testing set shape: (8301, 4)

In [95]:
score = model.score(X_test, y_test)
print("R-squared:", score)

R-squared: 0.16156763290522336

In [96]:
from sklearn.linear_model import LinearRegression

# Create a linear regression model
model = LinearRegression()

# Fit the model to the training data
model.fit(X_train, y_train)

# Print the coefficients and intercept of the model
print("Coefficients:", model.coef_)
print("Intercept:", model.intercept_)

Coefficients: [  -17.46709708  8978.95944826 -2728.90714427  7152.4344075 ]
Intercept: 151902.25455077185

In [100]:
# Create a new input data point
new_data = [[61, 5, 1, 0]]

# Make a salary prediction using the trained model
prediction = model.predict(new_data)

# Print the predicted salary
print("Predicted salary:", prediction)

Predicted salary: [193002.65172574]

/home/pragna/.local/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(